Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ2048EFH100.PIC
      <edc:SFRDef edc:_addr="0x1F810270" edc:_begin="0x140" edc:_end="0x2c0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD17IS" edc:desc="" edc:mask="0x3" edc:name="ADCD17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD17IP" edc:desc="" edc:mask="0x7" edc:name="ADCD17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD18IS" edc:desc="" edc:mask="0x3" edc:name="ADCD18IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD18IP" edc:desc="" edc:mask="0x7" edc:name="ADCD18IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD19IS" edc:desc="" edc:mask="0x3" edc:name="ADCD19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD19IP" edc:desc="" edc:mask="0x7" edc:name="ADCD19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD20IS" edc:desc="" edc:mask="0x3" edc:name="ADCD20IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD20IP" edc:desc="" edc:mask="0x7" edc:name="ADCD20IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810280" edc:_begin="0x140" edc:_end="0x2c0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD21IS" edc:desc="" edc:mask="0x3" edc:name="ADCD21IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD21IP" edc:desc="" edc:mask="0x7" edc:name="ADCD21IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD22IS" edc:desc="" edc:mask="0x3" edc:name="ADCD22IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD22IP" edc:desc="" edc:mask="0x7" edc:name="ADCD22IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD23IS" edc:desc="" edc:mask="0x3" edc:name="ADCD23IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD23IP" edc:desc="" edc:mask="0x7" edc:name="ADCD23IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD24IS" edc:desc="" edc:mask="0x3" edc:name="ADCD24IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD24IP" edc:desc="" edc:mask="0x7" edc:name="ADCD24IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810290" edc:_begin="0x140" edc:_end="0x2c0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC21" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD25IS" edc:desc="" edc:mask="0x3" edc:name="ADCD25IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD25IP" edc:desc="" edc:mask="0x7" edc:name="ADCD25IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD26IS" edc:desc="" edc:mask="0x3" edc:name="ADCD26IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD26IP" edc:desc="" edc:mask="0x7" edc:name="ADCD26IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD27IS" edc:desc="" edc:mask="0x3" edc:name="ADCD27IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD27IP" edc:desc="" edc:mask="0x7" edc:name="ADCD27IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD28IS" edc:desc="" edc:mask="0x3" edc:name="ADCD28IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD28IP" edc:desc="" edc:mask="0x7" edc:name="ADCD28IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102A0" edc:_begin="0x140" edc:_end="0x2c0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC22" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD29IS" edc:desc="" edc:mask="0x3" edc:name="ADCD29IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD29IP" edc:desc="" edc:mask="0x7" edc:name="ADCD29IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD30IS" edc:desc="" edc:mask="0x3" edc:name="ADCD30IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD30IP" edc:desc="" edc:mask="0x7" edc:name="ADCD30IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD31IS" edc:desc="" edc:mask="0x3" edc:name="ADCD31IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD31IP" edc:desc="" edc:mask="0x7" edc:name="ADCD31IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD32IS" edc:desc="" edc:mask="0x3" edc:name="ADCD32IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD32IP" edc:desc="" edc:mask="0x7" edc:name="ADCD32IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102B0" edc:_begin="0x140" edc:_end="0x2c0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="3" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC23" edc:desc="" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC23" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD33IS" edc:desc="" edc:mask="0x3" edc:name="ADCD33IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD33IP" edc:desc="" edc:mask="0x7" edc:name="ADCD33IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD34IS" edc:desc="" edc:mask="0x3" edc:name="ADCD34IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD34IP" edc:desc="" edc:mask="0x7" edc:name="ADCD34IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe0e0ffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
