Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ2048EFH100.PIC
      <edc:SFRDef edc:_addr="0x1F8FB424" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="140" edc:access="------------------------------rr" edc:cname="SBT13ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT13ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8FB428" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="140" edc:access="-------n------------------------" edc:cname="SBT13ECON" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="SBT13ECON" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="ERRP" edc:desc="" edc:mask="0x1" edc:name="ERRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8FB42C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8FB430" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="141" edc:access="-------------------------------r" edc:cname="SBT13ECLRS" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT13ECLRS" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8FB434" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8FB438" edc:_begin="0x14" edc:_end="0x18" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="142" edc:access="-------------------------------r" edc:cname="SBT13ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT13ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8FB43C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8FB440" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="143" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT13REG0" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT13REG0" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8FB444" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8FB450" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="144" edc:access="----------------------------nnnn" edc:cname="SBT13RD0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT13RD0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8FB454" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8FB458" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="145" edc:access="----------------------------nnnn" edc:cname="SBT13WR0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT13WR0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RG15"/>
      <edc:VirtualPin edc:name="AERXERR"/>
      <edc:VirtualPin edc:name="AN23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="AN34"/>
      <edc:VirtualPin edc:name="EBIA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RPE5" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="EBID5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="EBID6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="EBID7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="1" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="EBIA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN21"/>
      <edc:VirtualPin edc:name="EBIA12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RPC3" edc:ppsgroup="3" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN20"/>
      <edc:VirtualPin edc:name="EBIWE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RPC4" edc:ppsgroup="2" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="EBIOE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="RPG6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="ECOL"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="SDA4"/>
      <edc:VirtualPin edc:name="RPG7" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="ECRS"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="EBIA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="SCL4"/>
      <edc:VirtualPin edc:name="RPG8" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AECRSDV"/>
      <edc:VirtualPin edc:name="AERXDV"/>
      <edc:VirtualPin edc:name="ECRSDV"/>
      <edc:VirtualPin edc:name="ERXDV"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="EBIA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPG9" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="AEREFCLK"/>
      <edc:VirtualPin edc:name="AERXCLK"/>
      <edc:VirtualPin edc:name="EREFCLK"/>
      <edc:VirtualPin edc:name="ERXCLK"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="EBIA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="EBIA16"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RE8"/>
      <edc:VirtualPin edc:name="RPE8" edc:ppsgroup="4" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AERXD0"/>
      <edc:VirtualPin edc:name="AN25"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="RE9"/>
      <edc:VirtualPin edc:name="RPE9" edc:ppsgroup="3" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AERXD1"/>
      <edc:VirtualPin edc:name="AN26"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="AN3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="4" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN46"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN47"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="RA9"/>
      <edc:VirtualPin edc:name="AERXD2"/>
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="AERXD3"/>
      <edc:VirtualPin edc:name="AN28"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN48"/>
      <edc:VirtualPin edc:name="EBIA10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN49"/>
      <edc:VirtualPin edc:name="EBIA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
      <edc:VirtualPin edc:name="EBIA13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="AETXERR"/>
      <edc:VirtualPin edc:name="ERXERR"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN29"/>
      <edc:VirtualPin edc:name="EBIA19"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="SCK5"/>
      <edc:VirtualPin edc:name="RPF13" edc:ppsgroup="4" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN30"/>
      <edc:VirtualPin edc:name="EBIA18"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="RPF12" edc:ppsgroup="3" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN31"/>
      <edc:VirtualPin edc:name="EBIA17"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="AECRS"/>
      <edc:VirtualPin edc:name="ERXD0"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="EBIA11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="AECOL"/>
      <edc:VirtualPin edc:name="ERXD1"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="RPB14" edc:ppsgroup="4" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AETXD3"/>
      <edc:VirtualPin edc:name="ERXD2"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="EBIA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AETXD2"/>
      <edc:VirtualPin edc:name="ERXD3"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="EBIA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="RPD14" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AETXD0"/>
      <edc:VirtualPin edc:name="AN32"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="SCK6"/>
      <edc:VirtualPin edc:name="RPD15" edc:ppsgroup="2" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AETXD1"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RPF3" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="SDA3"/>
      <edc:VirtualPin edc:name="RPF2" edc:ppsgroup="4" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="EBIRDY3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="SCL3"/>
      <edc:VirtualPin edc:name="RPF8" edc:ppsgroup="3" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="EBIRDY2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="EBICS0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="EBIRDY1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="EBIA14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="SDA5"/>
      <edc:VirtualPin edc:name="RPF4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBIA9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="SCL5"/>
      <edc:VirtualPin edc:name="RPF5" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBIA8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="1" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="2" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="RPD9" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBIA15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="SCK4"/>
      <edc:VirtualPin edc:name="RPD10" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AEMDC"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="AEMDIO"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="RPD1" edc:ppsgroup="4" edc:ppsval="0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="ETXEN"/>
      <edc:VirtualPin edc:name="EBID14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
      <edc:VirtualPin edc:name="EBID15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="RPD12" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="ETXD2"/>
      <edc:VirtualPin edc:name="EBID12"/>
    </edc:Pin>
